MichaelOwen2022/iMXRT5xx-Loader/SDK_2_12_0_EVK-MIMXRT595/components/codec/tfa9896/fsl_hal_registers.c
/*
 * Copyright 2019 NXP
 * All rights reserved.
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include <stdint.h>
#include <stdlib.h>
#include <math.h>
#include <stdio.h>
#include <string.h>
#include <assert.h>
#include "fsl_tfa9896.h"
#include "fsl_common.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define TFA_SWAP_UINT16_BYTE_SEQUENCE(x) (__REV16(x))

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
status_t TFA9896_ReadRegister(tfa9896_handle_t *handle, uint8_t subaddress, unsigned short *value)
{
    assert(handle->config != NULL);
    assert(handle->config->slaveAddress != 0U);

    uint16_t readValue = 0U;
#if defined(DEMO_VERBOSE)
    int i;
#endif

    if (CODEC_I2C_Receive(handle->i2cHandle, handle->config->slaveAddress, subaddress, 1U, (uint8_t *)&readValue, 2U) !=
        kStatus_HAL_I2cSuccess)
    {
        return kStatus_TFA9896_I2C_Fatal;
    }

    *value = TFA_SWAP_UINT16_BYTE_SEQUENCE(readValue);
#if defined(DEMO_VERBOSE)
    TFA9896_Printf("R(0x%02x):", subaddress);
    for (i = 0; i < transfer.dataSize; i++)
    {
        TFA9896_Printf("[0x%02x]", (unsigned char)((unsigned char *)transfer.data + i));
    }
    TFA9896_Printf("\r\n");
#endif

    return kStatus_TFA9896_Ok;
}

int tfa_read_reg(tfa9896_handle_t *handle, const uint16_t bf)
{
    status_t err = kStatus_TFA9896_Ok;
    uint16_t regvalue;

    /* bitfield enum - 8..15 : address */
    uint8_t address = (bf >> 8) & 0xff;

    err = TFA9896_ReadRegister(handle, address, &regvalue);
    if (err)
    {
        return -err;
    }

    return regvalue;
}

status_t TFA9896_WriteRegister(tfa9896_handle_t *handle, uint8_t subaddress, uint16_t value)
{
    assert(handle->config != NULL);
    assert(handle->config->slaveAddress != 0U);

#if defined(DEMO_VERBOSE)
    int i;
#endif

    uint16_t writeValue = TFA_SWAP_UINT16_BYTE_SEQUENCE(value);

    if (kStatus_HAL_I2cSuccess !=
        CODEC_I2C_Send(handle->i2cHandle, handle->config->slaveAddress, subaddress, 1U, (uint8_t *)&writeValue, 2U))
    {
        return kStatus_TFA9896_I2C_Fatal;
    }

#if defined(DEMO_VERBOSE)
    TFA9896_Printf("W(0x%02x):", subaddress);
    for (i = 0; i < transfer.dataSize; i++)
    {
        TFA9896_Printf("[0x%02x]", (unsigned char)((unsigned char *)transfer.data + i));
    }
    TFA9896_Printf("\r\n");
#endif

    return kStatus_TFA9896_Ok;
}

uint16_t TFA9896_GetBits(tfa9896_handle_t *handle, const uint16_t bf)
{
    uint16_t regvalue, msk;
    status_t err = kStatus_TFA9896_Ok;
    uint16_t value;
    uint8_t len     = bf & 0x0f;
    uint8_t pos     = (bf >> 4) & 0x0f;
    uint8_t address = (bf >> 8) & 0xff;
    err             = TFA9896_ReadRegister(handle, address, &regvalue);
    if (err != kStatus_TFA9896_Ok)
    {
        return 0U;
    }
    msk = ((1 << (len + 1)) - 1) << pos;
    regvalue &= msk;
    value = regvalue >> pos;

    return value;
}

uint16_t TFA9896_isFactory(tfa9896_handle_t *handle)
{
    return (TFA9896_GetBits(handle, TFA1_BF_MTPEX) == 1);
}

status_t TFA9896_SetBits(tfa9896_handle_t *handle, const uint16_t bf, const uint16_t value)
{
    status_t err = kStatus_TFA9896_Ok;
    uint16_t regvalue, msk, oldvalue;
    uint8_t len     = (bf & 0x0f) + 1;
    uint8_t pos     = (bf >> 4) & 0x0f;
    uint8_t address = (bf >> 8) & 0xff;
    err             = TFA9896_ReadRegister(handle, address, &regvalue);
    oldvalue        = regvalue;
    msk             = ((1 << len) - 1) << pos;
    regvalue &= ~msk;
    regvalue |= value << pos;

    if (oldvalue != regvalue)
    {
        err = TFA9896_WriteRegister(handle, (bf >> 8) & 0xff, regvalue);
    }

    return err;
}

status_t TFA9896_ReadData(tfa9896_handle_t *handle, unsigned char subaddress, int num_bytes, unsigned char data[])
{
    status_t err = kStatus_TFA9896_Ok;
#if defined(DEMO_VERBOSE)
    int i;
#endif

    err =
        CODEC_I2C_Receive(handle->i2cHandle, handle->config->slaveAddress, subaddress, 1U, (uint8_t *)data, num_bytes);

#if defined(DEMO_VERBOSE)
    TFA9896_Printf("R(0x%02x):", subaddress);
    for (i = 0; i < transfer.dataSize; i++)
        TFA9896_Printf("[0x%02x]", (unsigned char)((unsigned char *)transfer.data + i));
    TFA9896_Printf("\r\n");
#endif

    return err;
}

status_t TFA9896_WriteData(tfa9896_handle_t *handle,
                           unsigned char subaddress,
                           int num_bytes,
                           const unsigned char data[])
{
    status_t err = kStatus_TFA9896_Ok;
#if defined(DEMO_VERBOSE)
    int i;
#endif

    err = CODEC_I2C_Send(handle->i2cHandle, handle->config->slaveAddress, subaddress, 1U, (uint8_t *)data, num_bytes);

#if defined(DEMO_VERBOSE)
    TFA9896_Printf("W(0x%02x):", subaddress);
    for (i = 0; i < transfer.dataSize; i++)
    {
        TFA9896_Printf("[0x%02x]", (unsigned char)((unsigned char *)transfer.data + i));
    }
    TFA9896_Printf("\r\n");
#endif

    return err;
}

/* read the return code for the RPC call */
status_t checkRpcStatus(tfa9896_handle_t *handle, int *pRpcStatus)
{
    status_t error         = kStatus_TFA9896_Ok;
    unsigned short cf_ctrl = 0x0002; /* the value to sent to the CF_CONTROLS register: cf_req=00000000, cf_int=0,
                                        cf_aif=0, cf_dmem=XMEM=01, cf_rst_dsp=0 */
    unsigned short cf_mad = 0x0000;  /* memory address to be accessed (0 : Status, 1 : ID, 2 : parameters) */
    unsigned char mem[3];            /* will be filled with the status read from DSP memory */
    if (pRpcStatus == 0)
        return kStatus_TFA9896_Bad_Parameter;
#ifdef OPTIMIZED_RPC
    {
        /* minimize the number of I2C transactions by making use of the autoincrement in I2C */
        unsigned char buffer[4];
        /* first the data for CF_CONTROLS */
        buffer[0] = (unsigned char)((cf_ctrl >> 8) & 0xFF);
        buffer[1] = (unsigned char)(cf_ctrl & 0xFF);
        /* write the contents of CF_MAD which is the subaddress following CF_CONTROLS */
        buffer[2] = (unsigned char)((cf_mad >> 8) & 0xFF);
        buffer[3] = (unsigned char)(cf_mad & 0xFF);
        error     = TFA9896_WriteData(handle, 0x70, sizeof(buffer), buffer);
    }
#else
    /* 1) write DMEM=XMEM to the DSP XMEM */
    if (error == kStatus_TFA9896_Ok)
    {
        error = TFA9896_WriteRegister(handle, 0x70, cf_ctrl);
    }
    if (error == kStatus_TFA9896_Ok)
    {
        /* write the address in XMEM where to read */
        TFA9896_WriteRegister(handle, 0x71, cf_mad);
    }
#endif
    if (error == kStatus_TFA9896_Ok)
    {
        /* read 1 word (24 bit) from XMEM */
        error = TFA9896_ReadData(handle, 0x72, 3 /*sizeof(mem) */, mem);
    }
    if (error == kStatus_TFA9896_Ok)
    {
        *pRpcStatus = (mem[0] << 16) | (mem[1] << 8) | mem[2];
    }
    return error;
}

/* check that num_byte matches the memory type selected */
status_t check_size(tfa9896_DMEM_t which_mem, int num_bytes)
{
    status_t error  = kStatus_TFA9896_Ok;
    int modulo_size = 1;
    switch (which_mem)
    {
        case DMEM_PMEM:
            /* 32 bit PMEM */
            modulo_size = 4;
            break;
        case DMEM_XMEM:
        case DMEM_YMEM:
        case DMEM_IOMEM:
            /* 24 bit MEM */
            modulo_size = 3;
            break;
        default:
            error = kStatus_TFA9896_Bad_Parameter;
    }
    if (error == kStatus_TFA9896_Ok)
    {
        if ((num_bytes % modulo_size) != 0)
        {
            error = kStatus_TFA9896_Bad_Parameter;
        }
    }
    return error;
}

status_t writeParameter(tfa9896_handle_t *handle,
                        unsigned char module_id,
                        unsigned char param_id,
                        int num_bytes,
                        const unsigned char data[])
{
    status_t error;
    unsigned short cf_ctrl = 0x0002; /* the value to be sent to the CF_CONTROLS register: cf_req=00000000, cf_int=0,
                                        cf_aif=0, cf_dmem=XMEM=01, cf_rst_dsp=0 */
    unsigned short cf_mad = 0x0001;  /* memory address to be accessed (0 : Status, 1 : ID, 2 : parameters) */
    error                 = check_size(DMEM_XMEM, num_bytes);
    if (error == kStatus_TFA9896_Ok)
    {
        if ((num_bytes <= 0) || (num_bytes > MAX_PARAM_SIZE))
        {
            return kStatus_TFA9896_Bad_Parameter;
        }
    }
#ifdef OPTIMIZED_RPC
    {
        /* minimize the number of I2C transactions by making use of the autoincrement in I2C */
        unsigned char buffer[7];
        /* first the data for CF_CONTROLS */
        buffer[0] = (unsigned char)((cf_ctrl >> 8) & 0xFF);
        buffer[1] = (unsigned char)(cf_ctrl & 0xFF);
        /* write the contents of CF_MAD which is the subaddress following CF_CONTROLS */
        buffer[2] = (unsigned char)((cf_mad >> 8) & 0xFF);
        buffer[3] = (unsigned char)(cf_mad & 0xFF);
        /* write the module and RPC id into CF_MEM, which follows CF_MAD */
        buffer[4] = 0;
        buffer[5] = module_id + 128;
        buffer[6] = param_id;
        /* TFA9896_Printf("calling TFA9896_WriteData\n");*/
        error = TFA9896_WriteData(handle, 0x70, sizeof(buffer), buffer);
    }
#else
    if (error == kStatus_TFA9896_Ok)
    {
        error = TFA9896_WriteRegister(handle, 0x70, cf_ctrl);
    }
    if (error == kStatus_TFA9896_Ok)
    {
        TFA9896_WriteRegister(handle, 0x71, cf_mad);
    }
    if (error == kStatus_TFA9896_Ok)
    {
        unsigned char id[3];
        id[0] = 0;
        id[1] = module_id + 128;
        id[2] = param_id;
        error = TFA9896_WriteData(handle, 0x72, 3, id);
    }
#endif /* OPTIMIZED_RPC */
    if (error == kStatus_TFA9896_Ok)
    {
        int offset          = 0;
        int chunk_size      = ROUND_DOWN(NXP_I2C_MAX_SIZE, 3 /* XMEM word size */);
        int remaining_bytes = num_bytes;
        /* due to autoincrement in cf_ctrl, next write will happen at the next address */
        while ((error == kStatus_TFA9896_Ok) && (remaining_bytes > 0))
        {
            if (remaining_bytes < chunk_size)
            {
                chunk_size = remaining_bytes;
            }
            /* else chunk_size remains at initialize value above*/
            error = TFA9896_WriteData(handle, 0x72, chunk_size, data + offset);
            if (error != kStatus_TFA9896_Ok)
            {
                break;
            }
            remaining_bytes -= chunk_size;
            offset += chunk_size;
        }
    }
    return error;
}

