MichaelOwen2022/iMXRT5xx-Loader/SDK_2_12_0_EVK-MIMXRT595/components/codec/tfa9896/fsl_hal_registers.c
    if (error == kStatus_TFA9896_Ok)
    {
        /* 5) read the resulting data */
        error = TFA9896_WriteRegister(handle, 0x71, 2 /*start_offset*/);
        if (error != kStatus_TFA9896_Ok)
        {
            return error;
        }
        /* read in chunks, limited by max I2C length */
        for (i = 0; i < num_outbytes;)
        {
            int burst_size = ROUND_DOWN(MAX_I2C_LENGTH, 3 /*bytes_per_word*/);
            if ((num_outbytes - i) < burst_size)
            {
                burst_size = num_outbytes - i;
            }
            error = TFA9896_ReadData(handle, 0x72, burst_size, outdata + i);
            if (error != kStatus_TFA9896_Ok)
            {
                return error;
            }
            i += burst_size;
        }
    }

    return error;
}

status_t TFA9896_CheckICROMversion(tfa9896_handle_t *handle, const unsigned char patchheader[])
{
    status_t error = kStatus_TFA9896_Ok;
    unsigned short checkrev;
    unsigned short checkaddress;
    int checkvalue;
    int value = 0;
    unsigned short status;
    checkrev = patchheader[0];
    if ((checkrev != 0xFF) && (checkrev != 0x96))
    {
        return kStatus_TFA9896_Not_Supported;
    }
    checkaddress = (patchheader[1] << 8) + patchheader[2];
    checkvalue   = (patchheader[3] << 16) + (patchheader[4] << 8) + patchheader[5];
    if (checkaddress != 0xFFFF)
    {
        /* before reading XMEM, check if we can access the DSP */
        error = TFA9896_ReadRegister(handle, 0x00, &status);
        if (error == kStatus_TFA9896_Ok)
        {
            if ((status & 0x8000) != 0x8000)
            {
                /* one of Vddd, PLL and clocks not ok */
                error = kStatus_TFA9896_DSP_not_running;
            }
        }
        /* read some address register that allows checking the correct ROM version */
        if (error == kStatus_TFA9896_Ok)
        {
            error = TFA9896_DspReadMem(handle, checkaddress, 1, &value);
        }
        if (error == kStatus_TFA9896_Ok)
        {
            if (value != checkvalue)
            {
                error = kStatus_TFA9896_Not_Supported;
            }
        }
    }
    return error;
}

int tfa_write_reg(tfa9896_handle_t *handle, const uint16_t bf, const uint16_t reg_value)
{
    status_t err;

    /* bitfield enum - 8..15 : address */
    uint8_t address = (bf >> 8) & 0xff;

    err = TFA9896_WriteRegister(handle, address, reg_value);
    if (err)
        return -err;

    return 0;
}

status_t TFA9896_DSP_System_Stable(tfa9896_handle_t *handle, int *ready)
{
#ifndef TFA9890_DEVICE
    status_t error = kStatus_TFA9896_Ok;
    unsigned short status;
    int value;

    /* check the contents of the STATUS register */
    value = tfa_read_reg(handle, TFA1_BF_AREFS);
    if (value < 0)
    {
        error  = -value;
        *ready = 0;
        /* an error here can be fatal */
        TFA9896_Printf("FATAL ERROR#######\n");
        return error;
    }
    status = (unsigned short)value;

    /* check AREFS and CLKS: not ready if either is clear */
    *ready = !((tfa_get_bf_value(TFA1_BF_AREFS, status) == 0) || (tfa_get_bf_value(TFA1_BF_CLKS, status) == 0) ||
               (tfa_get_bf_value(TFA1_BF_MTPB, status) == 1));

    return error;
#else
    return tfa9890_dsp_system_stable(handle, ready);
#endif
}

#ifdef TFA9896_DEBUG
static char *stateFlagsStr(int stateFlags)
{
    static char flags[10];

    flags[0] = (stateFlags & (0x1 << tfa9896_SpeakerBoost_ActivityLive)) ? 'A' : 'a';
    flags[1] = (stateFlags & (0x1 << tfa9896_SpeakerBoost_S_CtrlLive)) ? 'S' : 's';
    flags[2] = (stateFlags & (0x1 << tfa9896_SpeakerBoost_MutedLive)) ? 'M' : 'm';
    flags[3] = (stateFlags & (0x1 << tfa9896_SpeakerBoost_X_CtrlLive)) ? 'X' : 'x';
    flags[4] = (stateFlags & (0x1 << tfa9896_SpeakerBoost_T_CtrlLive)) ? 'T' : 't';
    flags[5] = (stateFlags & (0x1 << tfa9896_SpeakerBoost_NewModelLive)) ? 'L' : 'l';
    flags[6] = (stateFlags & (0x1 << tfa9896_SpeakerBoost_VolumeRdyLive)) ? 'V' : 'v';
    flags[7] = (stateFlags & (0x1 << tfa9896_SpeakerBoost_DamagedLive)) ? 'D' : 'd';
    flags[8] = (stateFlags & (0x1 << tfa9896_SpeakerBoost_SignalClippingLive)) ? 'C' : 'c';

    flags[9] = 0;
    return flags;
}
#endif

/* Execute RPC protocol to read something from the DSP */
status_t TFA9896_DspGetParam(
    tfa9896_handle_t *handle, unsigned char module_id, unsigned char param_id, int num_bytes, unsigned char data[])
{
    status_t error;
    unsigned short cf_ctrl = 0x0002; /* the value to be sent to the CF_CONTROLS register: cf_req=00000000, cf_int=0,
                                        cf_aif=0, cf_dmem=XMEM=01, cf_rst_dsp=0 */
    unsigned short cf_mad = 0x0001;  /* memory address to be accessed (0 : Status, 1 : ID, 2 : parameters) */
    unsigned short cf_status;        /* the contents of the CF_STATUS register */
    int rpcStatus = STATUS_OK;

    if (handle->config->slaveAddress == 0x1C)
    {
        /* cannot read */
        return kStatus_TFA9896_Bad_Parameter;
    }
    error = check_size(DMEM_XMEM, num_bytes);

    if (error == kStatus_TFA9896_Ok)
    {
        if ((num_bytes <= 0) || (num_bytes > MAX_PARAM_SIZE))
        {
            return kStatus_TFA9896_Bad_Parameter;
        }
    }
#ifdef OPTIMIZED_RPC
    {
        /* minimize the number of I2C transactions by making use of the autoincrement in I2C */
        unsigned char buffer[7];
        /* first the data for CF_CONTROLS */
        buffer[0] = (unsigned char)((cf_ctrl >> 8) & 0xFF);
        buffer[1] = (unsigned char)(cf_ctrl & 0xFF);
        /* write the contents of CF_MAD which is the subaddress following CF_CONTROLS */
        buffer[2] = (unsigned char)((cf_mad >> 8) & 0xFF);
        buffer[3] = (unsigned char)(cf_mad & 0xFF);
        /* write the module and RPC id into CF_MEM, which follows CF_MAD */
        buffer[4] = 0;
        buffer[5] = module_id + 128;
        buffer[6] = param_id;
        error     = TFA9896_WriteData(handle, 0x70, sizeof(buffer), buffer);
    }
#else
    /* 1) write the id and data to the DSP XMEM */
    if (error == kStatus_TFA9896_Ok)
    {
        error = TFA9896_WriteRegister(handle, 0x70, cf_ctrl);
    }
    if (error == kStatus_TFA9896_Ok)
    {
        error = TFA9896_WriteRegister(handle, 0x71, cf_mad);
    }
    if (error == kStatus_TFA9896_Ok)
    {
        unsigned char id[3];
        id[0] = 0;
        id[1] = module_id + 128;
        id[2] = param_id;
        /* only try MEM once, if error, need to resend mad as well */
        error = TFA9896_WriteData(handle, 0x72, 3, id);
    }
#endif
    /* 2) wake up the DSP and let it process the data */
    if (error == kStatus_TFA9896_Ok)
    {
        cf_ctrl |= (1 << 8) | (1 << 4); /* set the cf_req1 and cf_int bit */

        error = TFA9896_WriteRegister(handle, 0x70, (uint16_t)cf_ctrl);
    }
    /* 3) wait for the ack */
    if (error == kStatus_TFA9896_Ok)
    {
        int tries = 0;
        do
        {
            error = TFA9896_ReadRegister(handle, 0x73, &cf_status);
            tries++;
        } while (
            (error == kStatus_TFA9896_Ok) && ((cf_status & 0x0100) == 0) &&
            (tries < TFA9896_API_WAITRESULT_NTRIES)); /* don't wait forever, DSP is pretty quick to respond (< 1ms) */
        if (tries >= TFA9896_API_WAITRESULT_NTRIES)
        {
            /* something wrong with communication with DSP */
            return kStatus_TFA9896_DSP_not_running;
        }
    }
    /* 4) check the RPC return value */
    if (error == kStatus_TFA9896_Ok)
    {
        error = checkRpcStatus(handle, &rpcStatus);
    }
    if (error == kStatus_TFA9896_Ok)
    {
        if (rpcStatus != STATUS_OK)
        {
            /* DSP RPC call returned an error */
            error = (status_t)(rpcStatus + kStatus_TFA9896_RpcBase);
        }
    }
    /* 5) read the resulting data */
    if (error == kStatus_TFA9896_Ok)
    {
        cf_mad = 0x0002; /* memory address to be accessed (0 : Status, 1 : ID, 2 : parameters) */
        error  = TFA9896_WriteRegister(handle, 0x71, (uint16_t)cf_mad);
    }
    if (error == kStatus_TFA9896_Ok)
    {
        int offset          = 0;
        int chunk_size      = ROUND_DOWN(NXP_I2C_MAX_SIZE, 3 /* XMEM word size */);
        int remaining_bytes = num_bytes;
        /* due to autoincrement in cf_ctrl, next write will happen at the next address */
        while ((error == kStatus_TFA9896_Ok) && (remaining_bytes > 0))
        {
            if (remaining_bytes < 252)
            {
                chunk_size = remaining_bytes;
            }
            /* else chunk_size remains at initialize value above*/
            error = TFA9896_ReadData(handle, 0x72, chunk_size, data + offset);
            remaining_bytes -= chunk_size;
            offset += chunk_size;
        }
    }
    return error;
}

#ifdef TFA9896_LIVEDATA_CAPTURE
status_t TFA9896_DspGetStateInfo(tfa9896_handle_t *handle, tfa9896_StateInfoLive_t *pInfo)
{
    status_t error = kStatus_TFA9896_Ok;
    int24 data[FW_STATE_MAX_SIZE]; /* allocate worst case */
    unsigned char bytes[FW_STATE_MAX_SIZE * 3];
    int stateSize =
        FW_STATE_SIZE; /* contains the actual amount of parameters transferred, depends on IC and ROM code version */
    int i;

    assert(pInfo != 0);

    /* init to default value to have sane values even when some features aren't supported */
    for (i = 0; i < FW_STATE_MAX_SIZE; i++)
    {
        data[i] = 0;
    }

    error = TFA9896_DspGetParam(handle, MODULE_FRAMEWORK, FW_PARAM_GET_STATE, 3 * stateSize, bytes);
    if (error != kStatus_TFA9896_Ok)
    {
        if (error == kStatus_TFA9896_RpcParamId)
        {
            /* old ROM code, ask SpeakerBoost and only do first portion */
            stateSize = 8;
            error     = TFA9896_DspGetParam(handle, MODULE_SPEAKERBOOST, SB_PARAM_GET_STATE, 3 * stateSize, bytes);
        }
        else
        {
            return error;
        }
    }
    tfa9896_convert_bytes2data(3 * stateSize, bytes, data);
    pInfo->agcGain    = (float)data[0] / (1 << (23 - SPKRBST_AGCGAIN_EXP)); /* /2^23*2^(SPKRBST_AGCGAIN_EXP) */
    pInfo->limGain    = (float)data[1] / (1 << (23 - SPKRBST_LIMGAIN_EXP)); /* /2^23*2^(SPKRBST_LIMGAIN_EXP) */
    pInfo->sMax       = (float)data[2] / (1 << (23 - SPKRBST_HEADROOM));    /* /2^23*2^(SPKRBST_HEADROOM)    */
    pInfo->T          = data[3] / (1 << (23 - SPKRBST_TEMPERATURE_EXP));    /* /2^23*2^(def.SPKRBST_TEMPERATURE_EXP) */
    pInfo->statusFlag = data[4];
    pInfo->X1         = (float)data[5] / (1 << (23 - SPKRBST_HEADROOM)); /* /2^23*2^(SPKRBST_HEADROOM)        */

    pInfo->X2          = 0;                                                      /* /2^23*2^(SPKRBST_HEADROOM)        */
    pInfo->Re          = (float)data[6] / (1 << (23 - SPKRBST_TEMPERATURE_EXP)); /* /2^23*2^(SPKRBST_TEMPERATURE_EXP) */
    pInfo->shortOnMips = data[7];
    return error;
}

void dump_state_infoLive(tfa9896_StateInfoLive_t *pState)
{
#ifdef TFA9896_DEBUG
    TFA9896_Printf(
        "state: flags %s, agcGain %2.1f\tlimGain %2.1f\tsMax %2.1f\tT %d\tX1 %2.1f\tX2 %2.1f\tRe %2.2f\tshortOnMips "
        "%d\n",
        stateFlagsStr(pState->statusFlag), pState->agcGain, pState->limGain, pState->sMax, pState->T, pState->X1,
        pState->X2, pState->Re, pState->shortOnMips);
#endif
}
#endif

