MichaelOwen2022/iMXRT5xx-Loader/SDK_2_12_0_EVK-MIMXRT595/components/codec/tfa9896/fsl_hal_registers.c
status_t TFA9896_WaitCalibrateDone(tfa9896_handle_t *handle, int *calibrateDone)
{
    status_t err;
    int tries = 0;
    unsigned short mtp;
#define WAIT_TRIES 30000

    err = TFA9896_ReadRegister(handle, 0x80, &mtp);

    /* in case of calibrate once wait for MTPEX */
    if (mtp & 0x1)
    {
        while ((*calibrateDone == 0) && (tries < TFA9896_API_WAITRESULT_NTRIES))
        { /* TODO optimise with wait estimation */
            err            = TFA9896_ReadRegister(handle, 0x80, &mtp);
            *calibrateDone = (mtp & 0x2); /* check MTP bit1 (MTPEX) */
            tries++;
        }
    }
    else /* poll xmem for calibrate always */
    {
        while ((*calibrateDone == 0) && (tries < WAIT_TRIES))
        { /* TODO optimise with wait estimation*/
            err = TFA9896_DspReadMem(handle, 231, 1, calibrateDone);
            tries++;
        }
        if (tries == WAIT_TRIES)
        {
            TFA9896_Printf("calibrateDone 231 timedout\n");
        }
    }
    return err;
}

status_t TFA9896_DspGetCalibrationImpedance(tfa9896_handle_t *handle, float *pRe25)
{
    status_t error = kStatus_TFA9896_Ok;
    unsigned char bytes[3];
    int24 data[1];
    int calibrateDone;

    assert(pRe25 != 0);
    *pRe25 = 0.0f; /* default 0.0 */
    {
        error = TFA9896_DspReadMem(handle, 231, 1, &calibrateDone);
        if (error == kStatus_TFA9896_Ok)
        {
            if (!calibrateDone)
            {
                /* return the default */
                return error;
            }
            error = TFA9896_DspGetParam(handle, MODULE_SPEAKERBOOST, 0x85, 3, bytes);
        }
        if (error == kStatus_TFA9896_Ok)
        {
            tfa9896_convert_bytes2data(3, bytes, data);
            *pRe25 = ((float)data[0] / (1 << (23 - SPKRBST_TEMPERATURE_EXP)) * 1024) /
                     1000; /* /2^23*2^(def.SPKRBST_TEMPERATURE_EXP) */
        }
    }
    return error;
}

status_t TFA9896_DSP_Write_Mem_Word(tfa9896_handle_t *handle, unsigned short address, int value, int memtype)
{
    status_t error = kStatus_TFA9896_Ok;
    unsigned char bytes[3];

    TFA9896_SetBits(handle, TFA1_BF_DMEM, (uint16_t)memtype);
    error = -tfa_write_reg(handle, TFA1_BF_MADD, address);
    if (error != kStatus_TFA9896_Ok)
    {
        return error;
    }
    tfa9896_convert_data2bytes(1, &value, bytes);
    error = TFA9896_WriteData(handle, 0x720f >> 8, 3, bytes);

    return error;
}

/*************************/
#ifdef TFA9896_LIVEDATA_CAPTURE
status_t tfa9896GetSpeakerModel(tfa9896_handle_t *handle, int xmodel, tfa9896SPKRBST_SpkrModel_t *record)
{
    status_t error = kStatus_TFA9896_Ok;
    unsigned char bytes[3 * 141];
    int24 data[141];
    int i = 0;

    memset(bytes, 0, 423);

    /*PARAM_GET_LSMODELW*/
    error = TFA9896_DspGetParam(handle, 1, PARAM_GET_LSMODEL, 423, bytes);
    if (error != kStatus_TFA9896_Ok)
    {
        return error;
    }

    tfa9896_convert_bytes2data(sizeof(bytes), bytes, data);

    for (i = 0; i < 128; i++)
    {
        /*record->pFIR[i] = (double)data[i] / ((1 << 23) * 2);*/
        record->pFIR[i] = (double)data[i] / (1 << 22);
    }

    record->Shift_FIR     = data[i++];                        /* Exponent of HX data*/
    record->leakageFactor = (float)data[i++] / (1 << (23));   /* Excursion model integration leakage*/
    record->ReCorrection  = (float)data[i++] / (1 << (23));   /* Correction factor for Re*/
    record->xInitMargin = (float)data[i++] / (1 << (23 - 2)); /* (can change) Margin on excursion model during startup*/
    record->xDamageMargin =
        (float)data[i++] / (1 << (23 - 2));                /* Margin on excursion modelwhen damage has been detected*/
    record->xMargin  = (float)data[i++] / (1 << (23 - 2)); /* Margin on excursion model activated when LookaHead is 0*/
    record->Bl       = (float)data[i++] / (1 << (23 - 2)); /* Loudspeaker force factor*/
    record->fRes     = data[i++]; /* (can change) Estimated Speaker Resonance Compensation Filter cutoff frequency*/
    record->fResInit = data[i++]; /* Initial Speaker Resonance Compensation Filter cutoff frequency*/
    record->Qt       = (float)data[i++] / (1 << (23 - 6)); /* Speaker Resonance Compensation Filter Q-factor*/
    record->xMax     = (float)data[i++] / (1 << (23 - 7)); /* Maximum excursion of the speaker membrane*/
    record->tMax     = (float)data[i++] / (1 << (23 - 9)); /* Maximum Temperature of the speaker coil*/
    record->tCoefA   = (float)data[i++] / (1 << 23);       /* (can change) Temperature coefficient*/

    return error;
}

void dump_speaker_model(tfa9896SPKRBST_SpkrModel_t *pState, tfa9896_handle_t *handle)
{
    TFA9896_Printf("FRes:%d--SPKS:%d\n", pState->fRes, TFA9896_GetBits(handle, TFA1_BF_SPKS));
}
#endif

status_t TFA9896_PrintCalibration(tfa9896_handle_t *handle)
{
    status_t err = kStatus_TFA9896_Ok;
#ifdef TFA9896_DEBUG
    unsigned char bytes[6] = {0};
    int24 data[2];
    float mohm;

    err = TFA9896_DspGetParam(handle, MODULE_SPEAKERBOOST, SB_PARAM_GET_RE0, 3, bytes);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }

    tfa9896_convert_bytes2data(3, bytes, data);
    mohm = ((float)data[0] * 1024) / TFA1_FW_ReZ_SCALE;

    TFA9896_Printf(" Calibrated value :%1.2f mOhms :\n", (mohm * 1024) / 1000);
#endif

    return err;
}

status_t TFA9896_SetOneTimeCalibration(tfa9896_handle_t *handle)
{
    unsigned short mtp = 0;
    status_t err       = kStatus_TFA9896_Ok;
    int tries = 0, mtpBusy = 0;
    int i;
    /* Read MTP register*/
    TFA9896_Printf("totest\n");
    /* Set MTPOTC=1*/
    mtp |= 0x01;
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0x5A6B);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x0B, (uint16_t)0x005A);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    /* Update contents of MTP register*/
    err = TFA9896_WriteRegister(handle, 0x80, mtp);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_SetBits(handle, TFA1_BF_CIMTP, 0x01);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0x5A6B);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x0B, (uint16_t)0);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    tries = 0;
    do
    {
        tries++;
        for (i = 0; i < 0xfff; i++)
            ;
        mtpBusy = TFA9896_GetBits(handle, TFA1_BF_MTPB);
    } while ((mtpBusy == 0x01) && (tries < TFA9896_API_WAITRESULT_NTRIES));

    if (tries == TFA9896_API_WAITRESULT_NTRIES)
    {
        TFA9896_Printf("MTP Busy timedout\n");
        err = kStatus_TFA9896_StateTimedOut;
    }

